Revit 2024 API
RebarContainerItem.RebarShapeId Property
 The RebarShape element that defines the shape of the rebar.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public ElementId RebarShapeId { get; set; }
Visual Basic
Public Property RebarShapeId As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ RebarShapeId {
	ElementId^ get ();
	void set (ElementId^ value);
}
Remarks
 Changing the value of this property causes the Rebar instance to choose values for its shape parameters to preserve its previous shape as closely as possible
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: shapeId is not the id of a RebarShape in the document. -or- When setting this property: The RebarShape has End Treatments
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
RebarContainerItem Class
Autodesk.Revit.DB.Structure Namespace